Revit 2018 API
OpenOptions Properties
The OpenOptions type exposes the following members.
Properties
Name | Description
AllowOpeningLocalByWrongUser
 Specifies whether a local file is allowed to be opened as read-only by a user other than its owner.
Audit
 Specifies whether to expand all elements in order to check for corruption.
DetachFromCentralOption
 An option that specifies whether or not a workset-enabled document is detached from its central document.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
OpenOptions Class
Autodesk.Revit.DB Namespace